Revit 2026 API

# SystemsAnalysisOptionsOutputFolder Property

---

The path of the output folder for systems analysis.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string OutputFolder { get; set; }
```
```vb
Public Property OutputFolder As String
	Get
	Set
```
```cpp
public:
property String^ OutputFolder {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member OutputFolder : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The analysis requires a valid output folder path or empty string. |
| ArgumentNullException | When setting this property: A non-optional argument was null |

When requesting a new system analysis, it is okay to have an empty output folder in the SystemsAnalysisOption. In that case, the ViewSystemsAnalysisReport would supply the output folder, typically at the system TEMP folder.

#### Reference

SystemsAnalysisOptions Class

Autodesk.Revit.DB.Analysis Namespace